{"timestamp":1609872853728,"posts":[{"message":"Dear sisters and brothers in Christ,\nI can’t say that 2020 was unlike any other year in human history, but it was certainly difficult, unsettling, disruptive, and stressful. 2020 is the only year in our collective memories where our parish has been closed for public worship for over half of the year (!) What this closure will mean for St. James, Paris and our Diocese is still unclear as Covidtide continues to overshadow us with uncertainty in so many things, not only in the life of the Church but also in our lives as individuals, families, community, and country.\n\nWe cannot and should not speculate or rush to conclusions about any of this. Such a response is not the way of Christian virtue, the way of patience and charity. Yes, our patience has been sorely tried this year, but we cannot hurry to answers. The questions ‘why?’ and ‘how long?’ reverberate in our hearts and minds as we endure this pandemic. Various experts, both professional and self-proclaimed, offer us answers to these questions. However, these answers lead to further questions and so the cycle of uncertainty continues and our questions persist. Perhaps the best way to answer the questions ‘why?’ and ‘how long?’ is answer them the way God answers them.\n\nGod answers the questions ‘why?’ and ‘how long?’ through the path of the Incarnation, the way of Jesus Christ – Emmanuel, God-with-us. From a purely human perspective, we cannot answer these questions. However, from a divine perspective, God gives us the answer: Jesus, God the Son, the second Person of the Triune God. This answer sounds quaint, far-fetched, superstitious, and ridiculous to our secular age. Of course, this should be no surprise as our secular age is fixated on a purely human perspective. And therein lies the problem – we get stuck in an endless feedback loop of questions that seem to have no answer.\n\nJesus as the answer to our questions and longings does not mean that he will make all our problems disappear and that everything will be sunshine and rainbows. Remember, the path of the Incarnation was a path that led to the Cross. Indeed, Jesus tells his disciples to expect that suffering will be part of their earthly lives. However, the path of the Incarnation does not end at the Cross; this path continues through the Resurrection and Ascension into heaven. It is a path that leads to the very heart of God. Jesus invites us to walk this path with him giving us the assurance that we do not walk alone; he walks with us and we walk with each other. Jesus gives us the gifts of the Holy Spirit and the Church to fulfill his promise to never abandon us nor forsake us, even as we walk the dark and difficult parts of the path.\n\nIt is the gifts of faith, hope, and love that help us to see through these dark and difficult parts of the path. These gifts shine through with the light of Christ and remind us that the path leads to the very heart of God.\n\nSo, while 2020 was a difficult year, it was also a year of God’s goodness and grace. I am thankful for St. James, Paris and all the ways it continues to be a parish where God’s love grows. I am thankful for the stability of our parish family, a stability rooted in worship, prayer, and mutual care. I am thankful for all the phone calls and notes of encouragement and support I’ve received knowing that if I am receiving such gifts, then others in our parish family are as well. I am thankful for the myriad of spiritual gifts exhibited by our staff and leadership teams as they demonstrated remarkable adaptability and flexibility. I am thankful for our cemetery and for those who work so diligently to care for its upkeep so that we were able to worship there over the summer. I am thankful for the continued generosity of those who offer their time, talents, and treasure in support of our mission and ministry. I am thankful for the hard work of the Autumn Festival Executive Team and the Xmas Tree Team – and for the amazing support from our community! And finally, in the words of Pope Francis, “We thank God for the good things that have taken place during the pandemic, for the many people who, without making noise, have tried to make the weight of this trial more bearable”.\n\nI think this time of the virus continues to offer us an opportunity for us to reflect more deeply upon God, to set aside our false trusts and reorient ourselves back towards God. In doing so, we are re-learning the way of faith, hope, and love, we a learning that all the good that continues to persist in the world, all the light that shines in the darkness, comes from God. What a gift it is to be invited to be mirrors and reflectors of God’s heavenly light! To whom can you shine the light of God’s love today?\n\n2021 will be a unique year as well, full of its own uncertainties and challenges. And yet, it too will be the year of God’s goodness and grace. So, as we change the calendar, let us continue to fix our eyes on the God who does not change, but remains as he is: the God of faithful, merciful, un-ending love. May you know the deep love of this God today, tomorrow, and forever!\n\nYours in Christ,\n- Fr Jason+","type":"","image":{"height":480,"src":"https://scontent-iad3-1.xx.fbcdn.net/v/t1.0-0/p480x480/134914314_2658701994350417_3255271061844920625_o.jpg?_nc_cat=109&ccb=2&_nc_sid=8024bb&_nc_ohc=GR1Hj170P_4AX-Iy66-&_nc_ht=scontent-iad3-1.xx&tp=6&oh=6c720de477948246cd84c1cdf9c9b029&oe=601AA7AC","width":720},"href":"https://www.facebook.com/1647096332177660/posts/2658702157683734/","time":"December, 31 2020"},{"message":"Remember us, O God;\nfrom age to age be our comforter.\nYou have given us the wonder of time,\nblessings in days and nights, seasons and years.\nBless your children at the turning of the year\nand fill the months ahead with the bright hope\nthat is ours in the coming of Christ.\nYou are our God, living and reigning, forever and ever.\nAmen.","type":"","image":{"height":720,"src":"https://scontent-iad3-1.xx.fbcdn.net/v/t1.0-9/s720x720/135513023_2659411880946095_3324643615599307954_o.jpg?_nc_cat=101&ccb=2&_nc_sid=110474&_nc_ohc=Vq_cbaFbNpQAX-wATUU&_nc_ht=scontent-iad3-1.xx&tp=7&oh=df154fce339b243a4fc678d52c4aad04&oe=601875D6","width":576},"href":"https://www.facebook.com/1647096332177660/posts/2659412014279415/","time":"January, 1 2021"},{"message":"Mary and Rachel: Biblical Women in Travail","type":"","image":{"height":360,"src":"https://external-iad3-1.xx.fbcdn.net/safe_image.php?d=AQGLAwSsV7_iVQvK&w=360&h=360&url=https%3A%2F%2Fi.ytimg.com%2Fvi%2FOj2Qw5JN5iI%2Fhqdefault.jpg&cfs=1&sx=0&sy=0&sw=360&sh=360&_nc_cb=1&_nc_hash=AQFV21xz9VcWXGN2","width":360},"href":"https://www.facebook.com/1647096332177660/posts/2660084720878811/","time":"January, 2 2021"},{"message":"The Octave Day of Christmas - Holy Communion (BCP)","type":"","image":{"height":720,"src":"https://external-iad3-1.xx.fbcdn.net/safe_image.php?d=AQGBduHsD9iW-HMT&w=720&h=720&url=https%3A%2F%2Fi.ytimg.com%2Fvi%2Fg9IPBwi0KCU%2Fmaxresdefault_live.jpg&cfs=1&_nc_cb=1&_nc_hash=AQEOzFvq2PYSh9C0","width":720},"href":"https://www.facebook.com/1647096332177660/posts/2660827264137890/","time":"January, 3 2021"},{"message":"The Church is a people of the written word – indeed, the majority of the New Testament is not only written, but letters, letters (also called ‘epistles’) written to specific communities to encourage and build up in faith, hope, and love. And because these communities are part of the Church catholic just as we are, these are letters written to us as well. So, not only is the Church a people of the written word, we are a people of letters.\n\nGetting personal mail is always a delight. Bills and advertisements are to be expected; but then a hand-written card or letter is discovered in the mailbox and the excitement kicks in as I check the return address to see who is writing and try to open the envelope as quickly as possible (without damaging the contents, of course!) I think it is safe to say that we all love getting personal mail!\n\nChristmastide is a season where lots of personal mail is expected – cards, letters, packages, and all sorts of other wonderful things. But what about afterward, when the glow of Christmas begins to fade? Sure, we have birthdays and anniversaries to look forward to, but there’s something about getting unanticipated personal mail that lightens the heart.\n\nThere is an opportunity for the Church to live out our vocation to be a people of faith, hope, and love by returning to our roots, so to speak, as a people of letters. I am inviting you to participating in what we are calling ‘The Epistle Project’. The goal of the ‘The Epistle Project’ is to strengthen and deepen the relationships in our parish family through letter writing. \n\nParticipating in 'The Epistle Project' is simple:\nWrite a personal letter (about one page long)\n- In the letter share three things:\n1) What is your favorite winter beverage and why\n2) What you are most looking forward to when St. James, Paris is able to re-open\n3) What you’ve learned about yourself during this past year\n4) Include your return address at the bottom of the letter so that the person who receives it can write back\n5) Feel free to add any other fun or whimsical touches to the letter\n\nWhen you’ve completed the letter, put it into a sealed envelope and drop it off to the parish office. From there the letter will be randomly addressed to another member of the parish family.\n\nThe plan is to have a set of questions about every month to help get the creative writing juices flowing. As more letters go out, the more our mutual relationships are strengthened. If you have questions, please contact me via phone (226-934-3929) or email jasonpostma@diohuron.org\n\nHappy letter writing!\n- Fr Jason+","type":"","image":{"height":405,"src":"https://scontent-iad3-1.xx.fbcdn.net/v/t1.0-9/s720x720/136393691_2662263713994245_5589258908485186227_n.jpg?_nc_cat=100&ccb=2&_nc_sid=8024bb&_nc_ohc=O_Bb-TiYgqYAX9hb4kT&_nc_ht=scontent-iad3-1.xx&tp=7&oh=ad8d495f1f010ef3b650ba5b0ae49293&oe=601A478C","width":720},"href":"https://www.facebook.com/1647096332177660/posts/2662264387327511/","time":"January, 5 2021"}]}