{"timestamp":1609946027149,"posts":[{"message":"Remember us, O God;\nfrom age to age be our comforter.\nYou have given us the wonder of time,\nblessings in days and nights, seasons and years.\nBless your children at the turning of the year\nand fill the months ahead with the bright hope\nthat is ours in the coming of Christ.\nYou are our God, living and reigning, forever and ever.\nAmen.","type":"","image":{"height":720,"src":"https://scontent-iad3-1.xx.fbcdn.net/v/t1.0-9/s720x720/135513023_2659411880946095_3324643615599307954_o.jpg?_nc_cat=101&ccb=2&_nc_sid=110474&_nc_ohc=Vq_cbaFbNpQAX__MdR4&_nc_ht=scontent-iad3-1.xx&tp=7&oh=eba21f8bb188166e745309f79b53d4b6&oe=601C6A56","width":576},"href":"https://www.facebook.com/1647096332177660/posts/2659412014279415/","time":"January, 1 2021"},{"message":"Mary and Rachel: Biblical Women in Travail","type":"","image":{"height":360,"src":"https://external-iad3-1.xx.fbcdn.net/safe_image.php?d=AQGLAwSsV7_iVQvK&w=360&h=360&url=https%3A%2F%2Fi.ytimg.com%2Fvi%2FOj2Qw5JN5iI%2Fhqdefault.jpg&cfs=1&sx=0&sy=0&sw=360&sh=360&_nc_cb=1&_nc_hash=AQFV21xz9VcWXGN2","width":360},"href":"https://www.facebook.com/1647096332177660/posts/2660084720878811/","time":"January, 2 2021"},{"message":"The Octave Day of Christmas - Holy Communion (BCP)","type":"","image":{"height":720,"src":"https://external-iad3-1.xx.fbcdn.net/safe_image.php?d=AQGBduHsD9iW-HMT&w=720&h=720&url=https%3A%2F%2Fi.ytimg.com%2Fvi%2Fg9IPBwi0KCU%2Fmaxresdefault_live.jpg&cfs=1&_nc_cb=1&_nc_hash=AQEOzFvq2PYSh9C0","width":720},"href":"https://www.facebook.com/1647096332177660/posts/2660827264137890/","time":"January, 3 2021"},{"message":"The Church is a people of the written word – indeed, the New Testament is not only written, but comprised largely of letters, letters (also called ‘epistles’) written to specific communities to encourage and build up in faith, hope, and love. And because these communities are part of the Church catholic just as we are, these are letters written to us as well. So, not only is the Church a people of the written word, we are a people of letters.\n\nGetting personal mail is always a delight. Bills and advertisements are to be expected; but then a hand-written card or letter is discovered in the mailbox and the excitement kicks in as I check the return address to see who is writing and try to open the envelope as quickly as possible (without damaging the contents, of course!) I think it is safe to say that we all love getting personal mail!\n\nChristmastide is a season where lots of personal mail is expected – cards, letters, packages, and all sorts of other wonderful things. But what about afterward, when the glow of Christmas begins to fade? Sure, we have birthdays and anniversaries to look forward to, but there’s something about getting unanticipated personal mail that lightens the heart.\n\nThere is an opportunity for the Church to live out our vocation to be a people of faith, hope, and love by returning to our roots, so to speak, as a people of letters. I am inviting you to participating in what we are calling ‘The Epistle Project’. The goal of the ‘The Epistle Project’ is to strengthen and deepen the relationships in our parish family through letter writing. \n\nParticipating in 'The Epistle Project' is simple:\nWrite a personal letter (about one page long)\n- In the letter share three things:\n1) What is your favorite winter beverage and why\n2) What you are most looking forward to when St. James, Paris is able to re-open\n3) What you’ve learned about yourself during this past year\n4) Include your return address at the bottom of the letter so that the person who receives it can write back\n5) Feel free to add any other fun or whimsical touches to the letter\n\nWhen you’ve completed the letter, put it into a sealed envelope and drop it off to the parish office. From there the letter will be randomly addressed to another member of the parish family.\n\nThe plan is to have a set of questions about every month to help get the creative writing juices flowing. As more letters go out, the more our mutual relationships are strengthened. If you have questions, please contact me via phone (226-934-3929) or email jasonpostma@diohuron.org\n\nHappy letter writing!\n- Fr Jason+","type":"","image":{"height":405,"src":"https://scontent-iad3-1.xx.fbcdn.net/v/t1.0-9/s720x720/136393691_2662263713994245_5589258908485186227_n.jpg?_nc_cat=100&ccb=2&_nc_sid=8024bb&_nc_ohc=sBgEv7cTJOIAX-8tXHY&_nc_ht=scontent-iad3-1.xx&tp=7&oh=bd678c4466b8a4c99f9ce8f6701a9527&oe=601A478C","width":720},"href":"https://www.facebook.com/1647096332177660/posts/2662264387327511/","time":"January, 5 2021"},{"message":"Happy Feast of the Epiphany!","type":"","image":{"height":720,"src":"https://scontent-iad3-1.xx.fbcdn.net/v/t1.0-9/p720x720/136788644_2662916813928935_1928113374309249696_o.jpg?_nc_cat=107&ccb=2&_nc_sid=8024bb&_nc_ohc=Z6RNouPGtuIAX9A3Mcb&_nc_ht=scontent-iad3-1.xx&tp=6&oh=794a06787b724fbdcdf40ae17b4b823d&oe=6019C788","width":720},"href":"https://www.facebook.com/1647096332177660/posts/2662917050595578/","time":"January, 6 2021"}]}